
// exports.__esModule = true
exports.default = {
  '登录': 'ចូល',
  '账号': 'គណនី',
  '卡池': 'អាងកាត',
  '卡池管理后台系统': 'ប្រព័ន្ធផ្ទៃខាងក្រោយនៃការគ្រប់គ្រងអាងទឹកកាត',
  '密码': 'ពាក្យសម្ងាត់',
  '验证码': 'កូដ​ផ្ទៀង​ផ្ទាត់',
  '帐号不能为空': 'គណនីមិនអាចទទេបានទេ។',
  '密码不能为空': 'ពាក្យសម្ងាត់មិនអាចទទេបានទេ។',
  '验证码不能为空': 'លេខកូដផ្ទៀងផ្ទាត់ត្រូវតែបំពេញ',
  '首页': 'ទំព័រ​មុខ',
  '主键': 'id',
  '设备id': 'ឧបករណ៍ id',
  '板区': 'តំបន់ចាន',
  '创建时间': 'ពេលវេលាបង្កើត',
  '查询': 'សាកសួរ',
  '板子': 'ក្តារ',
  '卡下标': 'អក្សរកាត់កាត',
  '手机号': 'លេខទូរសព្ទ',
  '卡的iccid': 'កាត iccid'
}
