import Vue from 'vue'
import VueI18n from 'vue-i18n'

import enLocale from 'element-ui/lib/locale/lang/en'
import zhLocale from 'element-ui/lib/locale/lang/zh-CN'
// import kmLocale from 'element-ui/lib/locale/lang/km'
import ElementLocale from 'element-ui/lib/locale'

// 页面中自定义变量
import en from '@/langs/en'
import km from '@/langs/km'
import zh from '@/langs/zh'

Vue.use(VueI18n)

const messages = {
  // en: {
  //   message: en,
  //   ...enLocale
  // },
  zh: {
    ...zh,
    ...zhLocale
  },
  km: {
    '登录': 'ចូល',
    '账号': 'គណនី',
    '卡池': 'អាងកាត',
    '卡池管理后台系统': 'ប្រព័ន្ធផ្ទៃខាងក្រោយនៃការគ្រប់គ្រងអាងទឹកកាត',
    '密码': 'ពាក្យសម្ងាត់',
    '验证码': 'កូដ​ផ្ទៀង​ផ្ទាត់',
    '帐号不能为空': 'គណនីមិនអាចទទេបានទេ។',
    '密码不能为空': 'ពាក្យសម្ងាត់មិនអាចទទេបានទេ។',
    '验证码不能为空': 'លេខកូដផ្ទៀងផ្ទាត់ត្រូវតែបំពេញ',
    '首页': 'ទំព័រ​មុខ',
    '用户': 'អ្នក​ប្រើ',
    '主键': 'id',
    '设备id': 'ឧបករណ៍ id',
    '板区': 'តំបន់ចាន',
    '创建时间': 'ពេលវេលាបង្កើត',
    '查询': 'សាកសួរ',
    '板子': 'ក្តារ',
    '卡下标': 'អក្សរកាត់កាត',
    '手机号': 'លេខទូរសព្ទ',
    '卡的iccid': 'កាត iccid',
    '版本号': 'លេខកំណែ',
    '设备编码': 'លេខឧបករណ៍',
    '在线': 'លើបណ្តាញ',
    '离线': 'ក្រៅបណ្តាញ',
    '工作流程': 'ដំណើរការការងារ',
    '分组': 'ក្រុម',
    '取码时间筛选': 'ទទួលបានតម្រងពេលវេលាលេខកូដផ្ទៀងផ្ទាត់',
    '码排序': 'ការតម្រៀបកូដ',
    'app更新': 'app បន្ត',
    '批量初始化': 'ការចាប់ផ្តើមបណ្តុំ',
    '号码拉黑': 'លេខដែលរារាំង',
    '项目切换': 'ការផ្លាស់ប្តូរគម្រោង',
    '批量重启': 'ចាប់ផ្តើមជាក្រុមឡើងវិញ',
    '批量闲置': 'បណ្តុំទំនេរ',
    '批量工作': 'ការងារជាបាច់',
    '释放卡': 'កាតដោះលែង',
    '编号': 'លេខ​សម្គាល់',
    '取码时间': 'ពេលវេលាទទួលបានលេខកូដ',
    '当前板': 'បន្ទះបច្ចុប្បន្ន',
    '板子数': 'ចំនួនក្តារ',
    '初始化比例': 'សមាមាត្រចាប់ផ្តើម',
    '是否在线': 'មានអ៊ីនធឺណិត',
    '用户id': 'លេខ​សម្គាល់​អ្នក​ប្រើ',
    '项目id': 'លេខសម្គាល់គម្រោង',
    'phone': 'ទូរស័ព្ទ',
    '初始化': 'ការចាប់ផ្តើម',
    '重启': 'ចាប់ផ្ដើមឡើងវិញ',
    '闲置': 'ទំនេរ',
    '接码': 'ទទួលលេខកូដ',
    '工作': 'ការងារ',
    '切换卡': 'ប្តូរកាត',
    '卡详情': 'ព័ត៌មានលម្អិតអំពីកាត',
    '未分组': 'មិនបានចាត់ថ្នាក់',
    '组': 'ក្រុម',
    '有取码时间': 'មានពេលដើម្បីទទួលបានលេខកូដផ្ទៀងផ្ទាត់',
    '无取码时间': 'មិនមានពេលដើម្បីទទួលបានលេខកូដផ្ទៀងផ្ទាត់ទេ។',
    '当前板排序': 'ការតម្រៀបបន្ទះបច្ចុប្បន្ន',
    '确定': 'ប្រាកដ',
    '取消': 'បោះបង់',
    '进行': 'ការប្រព្រឹត្ត',
    '修改状态': 'កែប្រែស្ថានភាព',
    '批量修改状态': 'កែប្រែស្ថានភាពជាបាច់',
    '操作': 'ដំណើរការ',
    '提示': 'ព័ត៌មានជំនួយ',
    '操作成功': 'ប្រតិបត្តិការជោគជ័យ',
    '释放': 'ដោះលែង',
    '批量释放状态': 'ស្ថានភាពនៃការចេញផ្សាយជាបាច់',
    '批量': 'បាច់',
    '重置接码': 'កំណត់លេខកូដផ្ទៀងផ្ទាត់ឡើងវិញ',
    '批量重置接码': 'កំណត់លេខកូដផ្ទៀងផ្ទាត់ឡើងវិញជាបាច់',
    '删除': 'លុប',
    '更新': 'បន្ត'
  }
}

const i18n = new VueI18n({
  locale: localStorage.lang || 'zh', // 初始未选择默认 zh 中文
  messages
})

ElementLocale.i18n((key, value) => i18n.t(key, value))
export default i18n
